smartinou/map/projects/beastfeedher/firmware/builds/tm4c129exl/BSP.cpp
// *****************************************************************************
//
// Project: PFPP
//
// Module: BSP.
//
// *****************************************************************************

//! \file
//! \brief BSP class.
//! \ingroup application_bsp

// *****************************************************************************
//
//        Copyright (c) 2016-2021, Martin Garon, All rights reserved.
//
// *****************************************************************************

// *****************************************************************************
//                              INCLUDE FILES
// *****************************************************************************

// QP Library.
#include "qpcpp.h"

// CMSIS Library.
#include "TM4C129ENCPDT.h"

// TI Library.
//#define TARGET_IS_BLIZZARD_RA1
//#define DTARGET_IS_SNOWFLAKE_RA0
//#define PART_TM4C129ENCPDT
#include <inc/hw_ints.h>
//#include "inc/hw_memmap.h" // duplicated defines in TM4C129ENCPDT.h
#include <inc/hw_types.h>
#include <driverlib/flash.h>
#include <driverlib/gpio.h>
#include <driverlib/interrupt.h>
#include <driverlib/pin_map.h>
#include <driverlib/rom.h>
#include <driverlib/rom_map.h>
#include <driverlib/sysctl.h>
#include <driverlib/systick.h>
#include <driverlib/uart.h>

#include <net/EthernetAddress.h>

#include "inc/Button.h"
#include "inc/GPIO.h"

#include "FatFSDisk.h"
#include "SDC.h"
#include "SPI.h"
#include "DS3234.h"
#include "TB6612.h"

#include "Display_AOs.h"
#include "Logging_AOs.h"
#include "BLE_AOs.h"
#include "LwIP_AOs.h"
#include "LwIP_Events.h"
#include "PFPP_AOs.h"
#include "RTCC_AOs.h"

#include "PFPP_Events.h"
#include "Signals.h"
#include "IBSP.h"
#include "BSP.h"

#include "netif/tm4c129/EthDrv.h"

#ifdef USE_UART0
#include "uartstdio.h"
#endif // USE_UART0

#ifdef USE_RTT
// SEGGER RTT.
#include <SEGGER_RTT.h>
#endif // USE_RTT

#ifdef Q_SPY
#if !defined(USE_UART0) && !defined(USE_RTT)
#error Must define USE_UART0 or USE_RTT for using Q_SPY
#endif
#endif // Q_SPY

// *****************************************************************************
//                      DEFINED CONSTANTS AND MACROS
// *****************************************************************************


// !!!!!!!!!!!!!!!!!!!!!!!!!!!!! CAUTION !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// Assign a priority to EVERY ISR explicitly by calling NVIC_SetPriority().
// DO NOT LEAVE THE ISR PRIORITIES AT THE DEFAULT VALUE!
// See NOTE00
enum KernelUnawareISRs {
    UART0_PRIO,
    // ...
    // Keep always last.
    MAX_KERNEL_UNAWARE_CMSIS_PRI
};


// "kernel-unaware" interrupts can't overlap "kernel-aware" interrupts.
Q_ASSERT_COMPILE(MAX_KERNEL_UNAWARE_CMSIS_PRI <= QF_AWARE_ISR_CMSIS_PRI);

// See NOTE00.
enum KernelAwareISRs {
    SYSTICK_PRIO = QF_AWARE_ISR_CMSIS_PRI,
    GPIOPORTA_PRIO,
    GPIOPORTE_PRIO,
    //GPIOPORTF_PRIO,
    // ...
    // Keep always last.
    MAX_KERNEL_AWARE_CMSIS_PRI
};

// "kernel-aware" interrupts should not overlap the PendSV priority.
Q_ASSERT_COMPILE(MAX_KERNEL_AWARE_CMSIS_PRI <= (0xFF >>(8-__NVIC_PRIO_BITS)));

static constexpr uint32_t sClkRate = 120000000;
static constexpr unsigned long sUartPortNbr = 0;
static constexpr uint32_t sUartBaudRate = 115200U;

enum RTTTerminal {
    _stdin = 0,
    _stdout = 1,
    _stderr = 2,
    _qspy = 3,
};
static constexpr unsigned int sRTTBufferIndex = 0U;
static constexpr size_t sRTTUpBufferSize = 1024;
static constexpr unsigned int sRTTQSPYTerminal = RTTTerminal::_qspy;

#ifdef Q_SPY

#define UART_TXFIFO_DEPTH   16U

#endif // Q_SPY

// *****************************************************************************
//                         TYPEDEFS AND STRUCTURES
// *****************************************************************************

namespace BSP {


class SSI0PinCfg
    : public CoreLink::SSIPinCfg {

public:
    SSI0PinCfg() : CoreLink::SSIPinCfg(0) {}
    ~SSI0PinCfg() {}

    void SetPins(void) const override {
        GPIO::EnableSysCtlPeripheral(sSSIPins.mPort);
        MAP_GPIOPinTypeSSI(
            sSSIPins.mPort,
            sSSIPins.mClkPin | sSSIPins.mRxPin | sSSIPins.mTxPin
        );

        // Set a weak pull-up on MISO pin for SD Card's proper operation.
        MAP_GPIOPadConfigSet(
            sSSIPins.mPort,
            sSSIPins.mRxPin,
            GPIO_STRENGTH_2MA,
            GPIO_PIN_TYPE_STD_WPU
        );

        MAP_GPIOPadConfigSet(
            sSSIPins.mPort,
            sSSIPins.mClkPin | sSSIPins.mTxPin,
            GPIO_STRENGTH_2MA,
            GPIO_PIN_TYPE_STD
        );
    }

private:
    // PQ0: SSI0CLK
    // PQ3: SSI0RX
    // PQ2: SSI0TX
    static struct SSIGPIO {
        unsigned long mPort;
        unsigned int  mClkPin;
        unsigned int  mRxPin;
        unsigned int  mTxPin;
    } constexpr sSSIPins = {
        GPIOQ_BASE,
        GPIO_PIN_0, // Clk.
        GPIO_PIN_3, // Rx.
        GPIO_PIN_2  // Tx.
    };
};


class Factory
    : public IBSPFactory {

public:
    virtual ~Factory() {
        // Empty Dtor.
    }


    static std::shared_ptr<IBSPFactory> Instance(void) {
        if (nullptr == Factory::mInstance.get()) {
            // Assigning the instance this way rather than with std::make_shared<>()
            // allows to make the Ctor private.
            BSP::Factory::mInstance = std::shared_ptr<IBSPFactory>(new Factory);
        }

        return Factory::mInstance;
    }


    // IBSPFactory Interface.
    std::shared_ptr<RTCC::AO::RTCC_AO> CreateRTCCAO(void) override {
        if (mRTCCAO.get() == nullptr) {
            mRTCC = CreateRTCC();
            // RTCC also implements both ITemperature and INVMem interfaces.
            mRTCCAO = std::make_shared<RTCC::AO::RTCC_AO>(*mRTCC, *mRTCC, *mRTCC);
        }
        return mRTCCAO;
    }


    // This could be used to get a temporary opaque pointer to RTCC AO,
    // For direct posting to AO for instance:
    //     QP::QActive * lPtr = GetOpaqueRTCCAO();
    //     lPtr->Post(myEvent);
    QP::QActive *GetOpaqueRTCCAO(void) const override { return mRTCCAO.get(); }


    QP::QActive *GetOpaqueBLEAO(void) const override { return nullptr; }
    //QP::QActive *GetOpaqueBLEAO(void) override { return mBLEAO.get(); }


