smartinou/map/projects/beastfeedher/firmware/builds/tm4c129exl/BSP.cpp
    unsigned int CreateDisks(void) override {
        // This BSP has one SDC device.
        if (mSDC.get() == nullptr) {
            GPIO lCSnPin(GPIOD_AHB_BASE, GPIO_PIN_0);
            mSDC = std::make_shared<SDC>(0, *mSPIDev, lCSnPin);
        }

        return FatFSDisk::GetDiskQty();
    }


    std::shared_ptr<QP::QActive> CreateLogFileSinkAO(void) override {
        if (mFileLogSink.get() == nullptr) {
            mFileLogSink = std::make_shared<Logging::AO::FileSink_AO>();
        }
        return mFileLogSink;
    }


    std::shared_ptr<QP::QActive> CreatePFPPAO(FeedCfgRec &aFeedCfgRec) override {
        if (mPFPPAO.get() == nullptr) {
            mMotorControl = CreateMotorControl();
            mPFPPAO = std::make_shared<PFPP::AO::Mgr_AO>(*mMotorControl, &aFeedCfgRec);
        }
        return mPFPPAO;
    }


    QP::QActive *GetOpaquePFPPAO(void) const override { return mPFPPAO.get(); }


    std::shared_ptr<QP::QActive> CreateDisplayMgrAO(void) override {
        return std::shared_ptr<Display::AO::Mgr_AO>(nullptr);
    }


    QP::QActive *GetOpaqueDisplayMgrAO(void) const override { return nullptr; }


    std::shared_ptr<QP::QActive> CreateLwIPMgrAO(void) override {
        // Only one instance of this object can exist.
        if (mLwIPMgrAO.get() == nullptr) {
            // Create all Ethernet drivers required before the AO.
            // LwIP::AO::Mgr doesn't use any local references to LwIPDrv.
            // They are referenced via LwIPDrv static functions.
            CreateEthDrv();
            mLwIPMgrAO = std::make_shared<LwIP::AO::Mgr_AO>();
        }
        return mLwIPMgrAO;
    }


    std::shared_ptr<QP::QActive> CreateBLEAO(void) override {
        return std::shared_ptr<PFPP::AO::BLE_AO>(nullptr);
    }


    // Local interface.
    static GPIO const &GetRTCCInterruptPin(void) { return mRTCCInterruptPin; }
    //static GPIO const &GetBLEInterruptPin(void) { return mBLEInterruptPin; }

    static uint8_t const sSysTick_Handler;
    static uint8_t const sGPIOPortA_IRQHandler;

private:
    Factory(const Factory&) = delete;
    Factory& operator=(const Factory&) = delete;
    explicit Factory(uint32_t aClkRate = sClkRate)
        : mClkRate(aClkRate)
        , mSSIPinCfg(nullptr)
        , mSPIDev(nullptr)
        , mRTCC(nullptr)
        , mRTCCAO(nullptr)
        , mFileLogSink(nullptr)
        , mMotorControl(nullptr)
        , mPFPPAO(nullptr)
        , mDisplayMgrAO(nullptr)
        , mSDC(nullptr) {

        // Ctor.
        Init();

        // SPIDev is required with several devices.
        mSPIDev = std::unique_ptr<CoreLink::SPIDev>(CreateSPIDev(0));

        // TODO: CONSIDER CREATING RTCC HERE TOO.
    }


    void Init(void) {
        // NOTE: SystemInit() already called from the startup code,
        // where clock already set (CLOCK_SETUP in lm3s_config.h)
        // SystemCoreClockUpdate() also called from there.
        // Settings done for 50MHz system clock.

        mClkRate = SysCtlClockFreqSet(
            SYSCTL_XTAL_25MHZ
                | SYSCTL_OSC_MAIN
                | SYSCTL_USE_PLL
                | SYSCTL_CFG_VCO_480,
            mClkRate
        );

        // Enable the clock to the peripherals used by the application.

        // Enable all required GPIO.
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
        //MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
        //MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);
        //MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOH);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOJ);
        MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);

#ifdef USE_UART0
        // Debug UART port.
        GPIO lU0RxGPIO(GPIOA_AHB_BASE, GPIO_PIN_0);
        GPIO lU0TxGPIO(GPIOA_AHB_BASE, GPIO_PIN_1);
        MAP_GPIOPinConfigure(GPIO_PA0_U0RX);
        MAP_GPIOPinConfigure(GPIO_PA1_U0TX);
        MAP_GPIOPinTypeUART(
            lU0RxGPIO.GetPort(),
            lU0RxGPIO.GetPin() | lU0TxGPIO.GetPin()
        );
        // Enable UART0:
        // @115200, 8-N-1.
        // Flush the buffers.
        UARTStdioInit(sUartPortNbr, mClkRate, sUartBaudRate);
#endif // USE_UART0

#ifdef USE_RTT
    // Leave here until RTT has other use than QSPY.
    SEGGER_RTT_Init();
    SEGGER_RTT_printf(sRTTBufferIndex, "Hello, World!\n");
    static constexpr auto sRTTUpBufferName = "RTTUpBuffer";
    static uint8_t sRTTUpBuffer[sRTTUpBufferSize] = {0};
    int lResult = SEGGER_RTT_ConfigUpBuffer(
        sRTTBufferIndex,
        sRTTUpBufferName,
        &sRTTUpBuffer[0],
        sizeof(sRTTUpBufferSize),
        SEGGER_RTT_MODE_NO_BLOCK_SKIP
    );

    if (lResult < 0) {
        // Error while configuring buffer.
        return;
    }

    static constexpr auto sRTTDownBufferName = "RTTDownBuffer";
    static constexpr size_t sRTTDownBufferSize = 64;
    static uint8_t sRTTDownBuffer[sRTTDownBufferSize] = {0};
    lResult = SEGGER_RTT_ConfigDownBuffer(
        sRTTBufferIndex,
        sRTTDownBufferName,
        &sRTTDownBuffer[0],
        sizeof(sRTTDownBufferSize),
        SEGGER_RTT_MODE_NO_BLOCK_SKIP
    );

    if (lResult < 0) {
        // Error while configuring buffer.
        return;
    }
#endif // USE_RTT

#ifdef Q_SPY
#ifdef USE_UART0
        // Enable interrupts.
        // Interrupt on rx FIFO half-full.
        // UART interrupts: rx and rx-to.
        MAP_UARTIntDisable(UART0_BASE, 0xFFFFFFFF);
        MAP_UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
        MAP_IntEnable(INT_UART0);
#endif // USE_UART0

        // Initialize the QS software tracing.
        if (0U == QS_INIT(nullptr)) {
            Q_ERROR();
        }
        QS_OBJ_DICTIONARY(&BSP::Factory::sSysTick_Handler);
        //QS_OBJ_DICTIONARY(&sGPIOPortA_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortC_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortD_IRQHandler);
        //QS_OBJ_DICTIONARY(&sGPIOPortF_IRQHandler);
#endif // Q_SPY
    }


