smartinou/map/projects/beastfeedher/firmware/builds/tm4c129exl/BSP.cpp
    CoreLink::SPIDev * CreateSPIDev(unsigned int aSSIID) {
        switch (aSSIID) {
        case 0:
            // Create pin configuration.
            // Initialize SPI Master.
            SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI0);
            mSSIPinCfg = std::make_unique<SSI0PinCfg>();
            return new CoreLink::SPIDev(SSI0_BASE, mClkRate, *mSSIPinCfg);

        case 1:
        default:
            return nullptr;
        }
    }


    std::unique_ptr<DS3234> CreateRTCC(void) {
        // Creates a DS3234 RTCC.
        // Calls the Ctor that uses default SPI slave configuration,
        // with specified CSn pin.
        unsigned long lInterruptNumber = INT_GPIOA;
        GPIO lCSnPin(GPIOA_AHB_BASE, GPIO_PIN_7);
        auto lRTCC = std::make_unique<DS3234>(
            2000,
            lInterruptNumber,
            mRTCCInterruptPin,
            *mSPIDev,
            lCSnPin
        );

        return lRTCC;
    }

    std::unique_ptr<TB6612> CreateMotorControl(void) {
        GPIO lIn1(GPIOB_AHB_BASE, GPIO_PIN_6);
        GPIO lIn2(GPIOB_AHB_BASE, GPIO_PIN_5);
        GPIO lPWM(GPIOB_AHB_BASE, GPIO_PIN_0);

        return std::make_unique<TB6612>(lIn1, lIn2, lPWM);
    }


    // When LwIP::AO::Mgr can get rid of any local reference to LwIPDrv,
    // it won't be necessary for this function to return a pointer to EthDrv.
    // It will be referenced via LwIPDrv static functions.
    void CreateEthDrv(void) {
        EthernetAddress lMAC = GetMACAddress();
        unsigned int lMyNetIFIndex = 0;
        unsigned int lPBufQueueSize = 8;
        mEthDrv = std::make_unique<EthDrv>(
            lMyNetIFIndex,
            lMAC,
            lPBufQueueSize,
            mClkRate
        );
    }


#if 0
    std::unique_ptr<BLE::BLE> CreateBLE(void) {
        unsigned long lInterruptNumber = INT_GPIOB;
        GPIO lCSnPin(GPIOB_AHB_BASE, GPIO_PIN_4);
        auto lBLE = std::make_unique<BLE::BLE>(
            lInterruptNumber,
            mBLEInterruptPin,
            *mSPIDev,
            lCSnPin
        );

        return lBLE;
    }
#endif


    EthernetAddress GetMACAddress(void) {
        // For the Stellaris Eval Kits, the MAC address will be stored in the
        // non-volatile USER0 and USER1 registers. These registers can be read
        // using the FlashUserGet function, as illustrated below.
        unsigned long lUser0 = 0;
        unsigned long lUser1 = 0;
        FlashUserGet(&lUser0, &lUser1);

        // Convert the 24/24 split MAC address from NV ram into a 32/16 split MAC address.
        EthernetAddress lMAC(
            static_cast<uint8_t>((lUser0 & 0x000000FFL) >>  0),
            static_cast<uint8_t>((lUser0 & 0x0000FF00L) >>  8),
            static_cast<uint8_t>((lUser0 & 0x00FF0000L) >> 16),
            static_cast<uint8_t>((lUser1 & 0x000000FFL) >>  0),
            static_cast<uint8_t>((lUser1 & 0x0000FF00L) >>  8),
            static_cast<uint8_t>((lUser1 & 0x00FF0000L) >> 16)
        );

        if (lMAC.IsValid()) {
            return lMAC;
        }

        return EthernetAddress(0x00, 0x50, 0x1d, 0xc2, 0x70, 0xff);
    }

    uint32_t mClkRate;
    std::unique_ptr<CoreLink::SSIPinCfg> mSSIPinCfg;
    std::unique_ptr<CoreLink::SPIDev> mSPIDev;
    std::unique_ptr<DS3234> mRTCC;
    std::shared_ptr<RTCC::AO::RTCC_AO> mRTCCAO;
    std::shared_ptr<Logging::AO::FileSink_AO> mFileLogSink;
    std::unique_ptr<TB6612> mMotorControl;
    std::shared_ptr<PFPP::AO::Mgr_AO> mPFPPAO;
    std::shared_ptr<Display::AO::Mgr_AO> mDisplayMgrAO;
    std::shared_ptr<SDC> mSDC;
    std::unique_ptr<EthDrv> mEthDrv;
    std::shared_ptr<LwIP::AO::Mgr_AO> mLwIPMgrAO;
    //std::unique_ptr<BLE::BLE> mBLE;
    //std::shared_ptr<PFPP::AO::BLE_AO> mBLEAO;

    static GPIO const mRTCCInterruptPin;
    //static GPIO const mBLEInterruptPin;

    static std::shared_ptr<IBSPFactory> mInstance;
};

} // namespace BSP


// *****************************************************************************
//                            FUNCTION PROTOTYPES
// *****************************************************************************

namespace BSP {
static void InitEtherLED(void);
static void InitUserLED(void);
static void SetUserLED(void);
static void ClrUserLED(void);
} // namespace BSP

#ifdef Q_SPY
static void TxData(void);
#endif // Q_SPY

// *****************************************************************************
//                             GLOBAL VARIABLES
// *****************************************************************************

static time_t sSystemTime = 0;

#ifdef Q_SPY
// For local extern "C" functions, not part of any namespace.
static QP::QSTimeCtr QS_tickTime_ = 0;
static QP::QSTimeCtr const QS_tickPeriod_ = SystemCoreClock / BSP::TICKS_PER_SEC;

namespace BSP {
    // event-source identifiers used for tracing
    uint8_t const Factory::sSysTick_Handler = 0U;
    uint8_t const Factory::sGPIOPortA_IRQHandler = 0U;
}

#endif // Q_SPY


// Button class should become GPIO class.
std::shared_ptr<IBSPFactory> BSP::Factory::mInstance = nullptr;
GPIO const BSP::Factory::mRTCCInterruptPin(GPIOA_AHB_BASE, GPIO_PIN_6);
//GPIO const BSP::Factory::mBLEInterruptPin(GPIOB_AHB_BASE, GPIO_PIN_1);


namespace BSP {

// Those variables are used locally in various stubs and IRQ handlers.
static Button const mManualFeedButton(GPIOJ_AHB_BASE, GPIO_PIN_0, INT_GPIOJ, 0);
static Button const mTimedFeedButton(GPIOJ_AHB_BASE, GPIO_PIN_1, INT_GPIOJ, 0);

static GPIO const sUserLEDPin(GPION_BASE, GPIO_PIN_1);
} // namespace BSP

// *****************************************************************************
//                            EXPORTED FUNCTIONS
// *****************************************************************************

namespace BSP {

std::shared_ptr<IBSPFactory> Init(void) {
    return Factory::Instance();
}


}  // namespace BSP

// *****************************************************************************
//                              LOCAL FUNCTIONS
// *****************************************************************************

