smartinou/map/projects/beastfeedher/firmware/builds/tm4c129exl/BSP.cpp
    if ((SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) == 0) {
        return QS_tickTime_ - static_cast<QSTimeCtr>(SysTickValueGet());
    } else {
        // The rollover occured, but the SysTick_ISR did not run yet.
        return QS_tickTime_ + QS_tickPeriod_
            - static_cast<QSTimeCtr>(SysTickValueGet()); //SysTick->VAL);
    }
}


//............................................................................
void QP::QS::onFlush(void) {
#ifdef USE_UART0

    // Tx FIFO depth.
    uint16_t lFIFOLen = UART_TXFIFO_DEPTH;
    uint8_t const *lBlockPtr = nullptr;

    QF_INT_DISABLE();
    while ((lBlockPtr = QS::getBlock(&lFIFOLen)) != nullptr) {
        QF_INT_ENABLE();
        // Busy-wait until TX FIFO empty.
        while (!MAP_UARTSpaceAvail(UART0_BASE)) {
        }

        // Any bytes in the block?
        while (lFIFOLen-- != 0U) {
            // Put into the TX FIFO.
            MAP_UARTCharPut(UART0_BASE, *lBlockPtr++);
        }

        // Re-load the Tx FIFO depth.
        lFIFOLen = UART_TXFIFO_DEPTH;
        QF_INT_DISABLE();
    }
#else
    // Tx FIFO depth.
    uint16_t lFIFOLen = SEGGER_RTT_GetAvailWriteSpace(sRTTBufferIndex);
    uint8_t const *lBlockPtr = nullptr;

    QF_INT_DISABLE();
    while ((lBlockPtr = QS::getBlock(&lFIFOLen)) != nullptr) {
        QF_INT_ENABLE();
        // Busy-wait until TX FIFO empty.
        while (SEGGER_RTT_GetAvailWriteSpace(sRTTBufferIndex) != sRTTUpBufferSize) {
        }

        SEGGER_RTT_SetTerminal(sRTTQSPYTerminal);
        unsigned int lLen = SEGGER_RTT_Write(sRTTBufferIndex, lBlockPtr, lFIFOLen);
        SEGGER_RTT_SetTerminal(0);
        // TODO: do something with len.
        static_cast<void>(lLen);
        // Re-load the Tx FIFO depth.
        lFIFOLen = SEGGER_RTT_GetAvailWriteSpace(sRTTBufferIndex);//UART_TXFIFO_DEPTH;
        QF_INT_DISABLE();
    }
#endif

    QF_INT_ENABLE();
}


//............................................................................
//! callback function to reset the target (to be implemented in the BSP)
void QP::QS::onReset(void) {
    //NVIC_SystemReset();
}


//............................................................................
//! callback function to execute a user command (to be implemented in BSP)
void QP::QS::onCommand(uint8_t aCmdId, uint32_t aParam1, uint32_t aParam2, uint32_t aParam3) {
    static_cast<void>(aCmdId);
    static_cast<void>(aParam1);
    static_cast<void>(aParam2);
    static_cast<void>(aParam3);

    //TBD
}


static void TxData(void) {
#ifdef USE_UART0
    // TX done?
    if (MAP_UARTSpaceAvail(UART0_BASE)) {
        // Max bytes we can accept.
        uint16_t lFIFOLen = UART_TXFIFO_DEPTH;

        QF_INT_DISABLE();
        // Get next block to transmit.
        uint8_t const *lBlockPtr = QS::getBlock(&lFIFOLen);
        QF_INT_ENABLE();

        // Any bytes in the block?
        while (lFIFOLen-- != 0U) {
            // Put into the FIFO.
            MAP_UARTCharPut(UART0_BASE, *lBlockPtr++);
        }
    }

#elif defined(USE_RTT)
    // TX done?
    unsigned int lAvailWriteSpace = SEGGER_RTT_GetAvailWriteSpace(sRTTBufferIndex);
    if (lAvailWriteSpace > 0) {
        // Max bytes we can accept.
        uint16_t lBlockLen = lAvailWriteSpace;

        QF_INT_DISABLE();
        // Get pointer to next block to transmit.
        uint8_t const *lBlockPtr = QP::QS::getBlock(&lBlockLen);
        QF_INT_ENABLE();

        while (lBlockLen != 0U) {
            SEGGER_RTT_SetTerminal(sRTTQSPYTerminal);
            unsigned int lWrittenLen = SEGGER_RTT_Write(sRTTBufferIndex, lBlockPtr, lBlockLen);
            SEGGER_RTT_SetTerminal(0);
            if (lBlockLen <= lWrittenLen) {
                lBlockLen -= lWrittenLen;
                lBlockPtr += lWrittenLen;
            } else {
                lBlockLen = 0;
            }
        }
    }
#endif
}

#endif // Q_SPY


extern "C" {

// LwIP
u32_t sys_now() {
    // Returns the current time in milliseconds.
    return SysTickValueGet() * BSP::MS_PER_TICK;
}


void sntp_set_system_time(time_t aTime) {
    sSystemTime = aTime;

    // Send event with new system time from SNTP.
    LwIP::Event::SystemTimeUpdate * const lEvent = Q_NEW(
        LwIP::Event::SystemTimeUpdate,
        LWIP_SYSTEM_TIME_UPDATE_SIG,
        aTime
    );

    QP::QF::PUBLISH(lEvent, nullptr);
}


void SysTick_Handler(void);
void SysTick_Handler(void) {

#ifdef Q_SPY
    {
        // Clear SysTick_CTRL_COUNTFLAG.
        // Account for the clock rollover.
        //uint32_t volatile lTmp = SysTick->CTRL;
        //static_cast<void>(lTmp);
        QS_tickTime_ += QS_tickPeriod_;
    }
#endif // Q_SPY

    // Call QF Tick function.
    QP::QF::TICK_X(0U, &BSP::Factory::sSysTick_Handler);

    // Uncomment those lines if need to publish every single tick.
    // Process time events for rate 0.
    // Publish to subscribers.
    //static QP::QEvt const sTickEvent(TIME_TICK_SIG);
    //QP::QF::PUBLISH(&sTickEvent, &sSysTick_Handler);
}


// GPIO port A interrupt handler.
void GPIOPortA_IRQHandler(void);
void GPIOPortA_IRQHandler(void) {

    // Get the state of the GPIO and issue the corresponding event.
    static constexpr bool sIsMasked = true;
    GPIO lRTCCInterruptPin = BSP::Factory::GetRTCCInterruptPin();
    unsigned long lIntStatus = MAP_GPIOIntStatus(lRTCCInterruptPin.GetPort(), sIsMasked);
    unsigned int lPin = lRTCCInterruptPin.GetPin();
    if (lPin & lIntStatus) {
        MAP_GPIOIntClear(lRTCCInterruptPin.GetPort(), lPin);

        // Signal to AO that RTCC generated an interrupt.
        // This can be done with direct POST to known RTCC AO, but since there's a single instance,
        // broadcasting the event/signal is just fine too.
        static QP::QEvt const sRTCCAlarmIntEvent(RTCC_INTERRUPT_SIG);
        //QP::QF::PUBLISH(&sRTCCAlarmIntEvent, 0);
        BSP::Factory::Instance()->GetOpaqueRTCCAO()->POST(&sRTCCAlarmIntEvent, 0);
    }
}


// GPIO port B interrupt handler.
void GPIOPortB_IRQHandler(void);
void GPIOPortB_IRQHandler(void) {
#if 0
    // Get the state of the GPIO and issue the corresponding event.
    static const bool lIsMasked = true;
    unsigned long lIntStatus = MAP_GPIOIntStatus(GPIOB_AHB_BASE, lIsMasked);
    unsigned int lPin = BSP::Factory::GetBLEInterruptPin().GetPin();
    if (lPin & lIntStatus) {
        MAP_GPIOIntClear(GPIOB_AHB_BASE, lPin);

        // Signal to AO that BLE generated an interrupt.
        static QP::QEvt const sBLEIntEvent(BLE_INTERRUPT_SIG);
        //QP::QF::PUBLISH(&sBLEIntEvent, 0);
        BSP::Factory::Instance()->GetOpaqueBLEAO()->POST(&sBLEIntEvent, 0);
    }
#endif
}


